# SegmentLengthDimensionsForHooksEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetailType..::..SegmentLengthDimensionsForHooksEnabled Property
RebarBendingDetailType Class See Also
---
Identifies if segment length dimensions for hooks will be shown or not. If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool SegmentLengthDimensionsForHooksEnabled { get; set; }
```

Visual Basic
---
```text
Public Property SegmentLengthDimensionsForHooksEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SegmentLengthDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace